---
kind: type
id: T:Autodesk.Revit.DB.Structure.ConnectionInputPointInfo
source: html/1a44f5bf-0f28-e1f6-0085-e35bec49d5c6.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPointInfo

An object that holds description information about a connection input point

## Syntax (C#)
```csharp
public class ConnectionInputPointInfo : IDisposable
```